Tekla Open API Reference for Tekla Structures 2025
ViewBase.Origin Property
 The view origin coordinates in the sheet.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point Origin { get; set; }
Public Property Origin As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
ViewBase Class
Tekla.Structures.Drawing Namespace